In [4]:
# import multiple files inside zip files
import glob
import zipfile
import pandas as pd
import os

dfs = []
dir_name = r"C:\Users\bhupe\OneDrive\Desktop\Data Analyst\Experiment"
for filename in os.listdir(dir_name):
    if filename.endswith('.zip'):
        zip_file = os.path.join(dir_name, filename)
        zf = zipfile.ZipFile(zip_file)
        dfs += [pd.read_excel(zf.open(f)) for f in zf.namelist()]
df = pd.concat(dfs,ignore_index=True)
df

        name   age
0      sohag    23
1     chayan    24
2      argha    26
3  souradeep    34
4     shivam    56
5        don    69
6       suva  3000
7    sudipta    99

In [12]:
# import excel file inside zip file
import pandas as pd
import zipfile

archive = zipfile.ZipFile(r'C:\Users\bhupe\OneDrive\Desktop\Data Analyst\Experiment\a1.zip')
xlfile = archive.open('a1.xlsx')
df = pd.read_excel(xlfile)
df

     name  age
0   sohag   23
1  chayan   24